#include<iostream>
using namespace std;

//对象初始化和清理
//1.构造函数 进行初始化操作
class Person
{
public:
	//1.1.构造函数
	//没有返回值 不用写void 
	//函数名与类名相同
	//构造函数可以有参数，可以发生重载
	//创建对象时，构造函数自动调用，仅一次
	Person()
	{
		cout << "Person构造函数的调用" << endl;
	}
	~Person()
	{
		cout << "析构函数调用" << endl;
	};

};
//构造和析构是必须有的实现，如果自己不提供，编译器会提供一个空实现的构造和析构
void test01()
{
	Person p;//在栈上的数据，test01执行完毕后，释放这个对象
}
//2.析构函数 进行清理操作
//没有返回值 不写void
//函数名和类名相同 在名称前加~
//不可以有参数，不可以重载
//对象销毁前会自动调用析构函数，而且只会调用一次


int main()
{

	test01();





	return 0;
}